let codeArr = [{
    name: "沪尚茗居",
    value: "41000元装修大礼包",
    rule: "66整装节价值41000元装修礼包（设计费价值20000元、管理费价值20000元、保洁费价值1000元），免资深设计师户型规划费，免装修全程施工管理费，免开荒保洁费让您直接拎包即入住。</br>1、活动仅限沪尚茗居签约整装业主参加；</br>2、需至沪尚茗居线下实景体验中心门店使用，无需提前预约；</br>3、活动使用期限：2021年6月23日-2021年12月31日；</br>4、此次活动产品不折现，不退换。</br>"
  },
  {
    name: "光明驾校",
    value: "200元学车抵用券",
    rule: "此券仅供小汽车C1/C2及摩托车E/F培训课程报名时使用，不找零，不兑现，不可用于测评及模拟，单次课程报名尽可使用1张抵用券。</br>适用期限：6.23~8.31。</br>适用门店：光明所属5个门店皆可。本券最终解释权归上海光明驾培集团所有。</br>"
  },
  {
    name: "悸动烧仙草",
    value: "宝藏仙草捞75折",
    rule: "有效期购买后7天有效（周末、法定节假日通用）</br>使用时间00:00-23:59,营业时间内核销</br>使用规则店内无包间，堂食外带均可，可以打包，打包费详情请咨询商家，无需预约，消费高峰期可能需要等位，限制性条款/特殊情况：本页面选取的参照价格为所有参加活动的高价位门店价格，每家门店的实际价格以门店公示为准。 如部分菜品因时令或其他不可抗因素导致无法提供，商家会用等价菜品替换，具体事宜请与商家协商 使用优惠券购买团单，有效期以优惠券规则为准，发票问题请询问商家. 团购用户不可同时享受商家其他优惠 酒水饮料等问题，请致电商家咨询，以商家反馈为准 如部分菜品因时令或其他不可抗因素导致无法提供，商家会用等价菜品替换，具体事宜请与商家协商 使用优惠券购买团单，有效期以优惠券规则为准，发票问题请询问商家"
  },
  {
    name: "钻石小鸟",
    value: "钻石大师定制抵扣券500元",
    rule: "有效期起止时间，2021-6-23至 2021-8-23</br>活动细则：凭券码至钻石小鸟线下门店兑换</br>兑换规则：</br>1. 同一用户仅限使用一张优惠券；</br>2. 本券不退换、不兑现、不找零，抵扣部分不开具发票；</br>3. 此优惠不与其他优惠同享；</br>4. 本券仅适用于银锆钻戒定制；</br>5.本券适用于以下门店</br>钻石小鸟上海旗舰店</br>钻石小鸟上海嘉定新城万达店</br>钻石小鸟上海金山万达店</br>钻石小鸟南京金鹰店</br>钻石小鸟杭州店</br>钻石小鸟上海青浦万达茂店</br>钻石小鸟上海松江万达店</br>钻石小鸟嵩明百联万达店</br>"
  },
  {
    name: "OSIM按摩椅",
    value: "养生体验套餐",
    rule: "凭该宝物券至OSIM上海门店兑换领取，礼品数量有限，请提前咨询021-51962828（周一至周五9:00-18:00)。礼品兑换时间（2021.06.24-2021.06.30）养生体验套餐（20分钟按摩+3D立体眼罩）,礼品数量养生体验套餐共250套（每套配送一副3D立体眼罩，共250副）。"
  },
  {
    name: "东方童画",
    value: "东方童画礼券",
    rule: "该宝物券仅限初次到店3-12岁小朋友，至东方童画线下门店兑换。</br>各门店礼品数量有限，领取前请提前3天电话预约，</br>电话：400-895-6006</br>礼品兑换时间：2021.6.20-2021.8.31。"
  },
  {
    name: "车开新",
    value: "免费车辆体检报告+车载香薰",
    rule: "凭该宝物券至车开新线下门店兑换礼品，各门店礼品数量有限，先到先得。领取前请提前电话预约（电话：4001036699），礼品兑换时间：2021.6.24-2021.7.30 9:00-18:00。"
  },
  {
    name: "AHAVA",
    value: "AHAVA水黄金系列四件套",
    rule: "凭该宝物券至AHAVA线下上海门店兑换AHAVA水黄金系列四件套礼品，各门店礼品数量有限，领取前请提前电话预约（上海新世界021-53862188，上海正大02153098781，上海BFC SPA 021-63307572，上海复地活力城 021-58942810），礼品兑换时间：2021.06.24-2021.06.30，礼品以实物为准。"
  },
  {
    name: "爱代拍",
    value: "线上无门槛优惠券300元",
    rule: "凭该宝物券至爱代拍平台微信公众号兑换礼品，平台礼品数量有限，领取去请先提前咨询公众号客服人员（工作日上班时间可直接咨询），礼品兑换时间（2021.06.24-2021.07.24），300元优惠券仅限线上无门槛下单优惠。"
  },
  {
    name: "爱代拍",
    value: "爱代拍logo雨伞/台式风扇",
    rule: "凭该宝物券至爱代拍平台微信公众号兑换礼品，平台礼品数量有限，领取去请先提前咨询公众号客服人员（工作日上班时间可直接咨询），礼品兑换时间（2021.06.24-2021.07.24），300元优惠券仅限线上无门槛下单优惠。"
  },
];